d = [3 0 0 0 3];
a = [0 20 10 0 0];
alpha = [-pi/2 0 0 pi/2 0];
%设置初值
L(1) = Link([0 d(1) a(1) alpha(1)],'modified');
L(2) = Link([0 d(2) a(2) alpha(2)],'offset',pi/2,'modified');
L(3) = Link([0 d(3) a(3) alpha(3)],'modified');
L(4) = Link([0 d(4) a(4) alpha(4)],'offset',pi/2,'modified');
L(5) = Link([0 d(5) a(5) alpha(5)],'modified');

%定义关节范围
L(1).qlim = [20,280]*pi/180;
L(2).qlim = [20,280]*pi/180;
L(3).qlim = [80,300]*pi/180;
L(4),qlim = [20,280]*pi/180;
L(5).qlim = [20,280]*pi/180;

robot = SerialLink(L,'name','MyRobot');
robot.tool = transl(0,0,100);
%需要得到每个关节的 质量，质心位置，惯性张量
%以上数据通常在SolidWorks中获得（指定材质→测量-质量属性）
%（可以先在关节角处创建一个坐标系，在质量属性的测量中指定输出坐标系

%动力学参数
data = [
    % Ixx Iyy Izz Ixy Ixz Iyz xc yc zc m 
        33434.735,   13371.342,   21162.848,     -474.874,     346.942,     15764.997,     -3.0688,      -166.5226,   143.0081,  0.513;
        9187.248,  21141.778,  29269.7,     13041.865,     -478.874,     296.759,    -172.4024,    115.7123,     -3.1772,   0.496;
         3333.58,  1033.429,  3949.954,    95.417,     -8.46,          231.071,     -54.0912,      96.6759,     -6.1275,   0.2501;
         628.201,    473.478,    973.895,      446.626,          -84.689,          98.694,      -48.3163,    56.2822,         -11.4767,   0.1335;
        420.577,   431.195,   63.216,          -10.502,      -51.925,          -73.812,      10.1699,          14.6280,    68.5056,   0.0741
       ];
%变换单位
%sw得到的
%惯性张量单位是 千克·平方毫米
%位置是 毫米
%质量是 kg
%如果加速度单位为 m·s-2，即 N/kg
%那么最后计算出的力矩的单位是 N·mm
data(:,1:6) = data(:,1:6)./1000000;
data(:,7:9) = data(:,7:9)./1000;

%惯性张量
data(:,[5 6]) = data(:,[6 5]); %交换Ixz和Iyz
for i = 1:5
    %I = [L_xx,L_yy,L_zz,L_xy,L_yz,L_xz];
    %放入是6个数字，但存储是矩阵形式的9个数字
    robot.links(i).I = data(i,1:6);
end

%质心
for i = 1:5
    robot.links(i).r = data(i,7:9);
end

%质量
for i = 1:5
    robot.links(i).m = data(i,10);
end

%重力
robot.gravity = [0,0,-9.81];

robot.plot([0 0 0 0 0]);

    
